-- phpMyAdmin SQL Dump
-- version 5.1.0
-- https://www.phpmyadmin.net/
--
-- Хост: 127.0.0.1:3306
-- Время создания: Сен 07 2026 г., 16:29
-- Версия сервера: 8.0.24
-- Версия PHP: 7.4.21

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `hotel`
--

-- --------------------------------------------------------

--
-- Структура таблицы `доп_услуга`
--

CREATE TABLE `доп_услуга` (
  `Код_услуги` int UNSIGNED NOT NULL,
  `Название` varchar(30) NOT NULL,
  `Стоимость` int UNSIGNED NOT NULL,
  `Описание` varchar(100) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

--
-- Дамп данных таблицы `доп_услуга`
--

INSERT INTO `доп_услуга` (`Код_услуги`, `Название`, `Стоимость`, `Описание`) VALUES
(1, 'Аренда велосипеда', 971, 'Аренда велосипеда на один день'),
(2, 'Сауна', 3038, 'Аренда сауны на два часа'),
(3, 'Мангал', 850, 'Аренда мангальной зоны'),
(4, 'Экскурсия', 1824, 'Экскурсия по окрестностям'),
(5, 'Прокат лодки', 2431, 'Прокат лодки на два часа'),
(6, 'Завтрак', 729, 'Комплексный завтрак'),
(7, 'Стирка', 244, 'Стирка одной вещи');

-- --------------------------------------------------------

--
-- Структура таблицы `администратор`
--

CREATE TABLE `администратор` (
  `Код_администратора` int UNSIGNED NOT NULL,
  `Фамилия` varchar(20) NOT NULL,
  `Имя` varchar(20) NOT NULL,
  `Отчество` varchar(20) NOT NULL,
  `Логин` varchar(20) NOT NULL,
  `Пароль` varchar(100) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

--
-- Дамп данных таблицы `администратор`
--

INSERT INTO `администратор` (`Код_администратора`, `Фамилия`, `Имя`, `Отчество`, `Логин`, `Пароль`) VALUES
(1, 'Петрова', 'Анна', 'Ивановна', 'admin1', 'Admin123'),
(2, 'Орлов', 'Максим', 'Сергеевич', 'admin2', 'Admin456'),
(3, 'Федорова', 'Ольга', 'Алексеевна', 'admin3', 'Admin789');

-- --------------------------------------------------------

--
-- Структура таблицы `бронирование`
--

CREATE TABLE `бронирование` (
  `Код_бронирования` int UNSIGNED NOT NULL,
  `Код_пользователя` int UNSIGNED NOT NULL,
  `Код_администратора` int UNSIGNED NOT NULL,
  `Код_статуса` int UNSIGNED NOT NULL,
  `Код_типа_номера` int UNSIGNED NOT NULL,
  `Дата_заезда` date NOT NULL,
  `Дата_выезда` date NOT NULL,
  `Количество_гостей` int UNSIGNED NOT NULL,
  `Количество_номеров` int UNSIGNED NOT NULL,
  `Пожелание` varchar(100) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

--
-- Дамп данных таблицы `бронирование`
--

INSERT INTO `бронирование` (`Код_бронирования`, `Код_пользователя`, `Код_администратора`, `Код_статуса`, `Код_типа_номера`, `Дата_заезда`, `Дата_выезда`, `Количество_гостей`, `Количество_номеров`, `Пожелание`) VALUES
(1, 1, 1, 3, 1, '2026-07-01', '2026-07-05', 2, 1, 'Номер с видом на озеро'),
(2, 2, 1, 3, 3, '2026-06-10', '2026-06-15', 4, 1, 'Детская кроватка'),
(3, 3, 2, 4, 2, '2026-08-20', '2026-08-24', 2, 1, 'Тихий номер'),
(4, 4, 2, 3, 4, '2026-08-25', '2026-08-28', 2, 1, 'Поздний заезд'),
(5, 5, 3, 4, 1, '2026-07-15', '2026-07-18', 1, 1, 'Без пожеланий'),
(6, 6, 3, 3, 5, '2026-09-01', '2026-09-06', 5, 1, 'Мангал рядом с коттеджем'),
(7, 1, 2, 3, 2, '2026-05-10', '2026-05-12', 2, 1, 'Без пожеланий'),
(8, 3, 1, 2, 3, '2026-09-10', '2026-09-14', 3, 1, 'Номер на первом этаже'),
(11, 7, 1, 4, 2, '2026-08-26', '2026-08-30', 2, 1, ''),
(12, 7, 1, 3, 2, '2026-08-26', '2026-08-30', 1, 1, ''),
(14, 7, 1, 4, 1, '2026-08-29', '2026-08-31', 1, 1, ''),
(15, 7, 1, 4, 5, '2026-08-25', '2026-08-29', 1, 1, ''),
(16, 7, 1, 4, 5, '2026-08-25', '2026-08-26', 1, 1, ''),
(19, 7, 1, 4, 4, '2026-08-26', '2026-09-04', 1, 1, ''),
(20, 7, 1, 3, 1, '2026-08-27', '2026-08-29', 2, 1, ''),
(21, 3, 1, 3, 5, '2026-08-27', '2026-09-06', 5, 1, ''),
(23, 7, 1, 4, 4, '2026-08-27', '2026-08-30', 2, 1, ''),
(24, 8, 1, 4, 5, '2026-08-27', '2026-08-29', 3, 1, ''),
(26, 7, 1, 4, 2, '2026-08-30', '2026-09-05', 1, 1, ''),
(27, 8, 1, 4, 1, '2026-08-30', '2026-09-06', 1, 1, ''),
(28, 8, 1, 3, 4, '2026-08-31', '2026-09-04', 1, 1, ''),
(29, 7, 1, 2, 3, '2026-08-31', '2026-09-26', 1, 1, ''),
(30, 7, 1, 5, 5, '2026-09-08', '2026-09-25', 6, 1, '5 подушек'),
(31, 7, 1, 5, 2, '2026-09-07', '2026-09-30', 1, 1, '');

-- --------------------------------------------------------

--
-- Структура таблицы `временная_таблица`
--

CREATE TABLE `временная_таблица` (
  `Код_записи` int UNSIGNED NOT NULL,
  `Действие` varchar(50) DEFAULT NULL,
  `Описание` varchar(255) DEFAULT NULL,
  `Дата_создания` timestamp NULL DEFAULT CURRENT_TIMESTAMP
) ENGINE=MEMORY DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

-- --------------------------------------------------------

--
-- Структура таблицы `журнал_номеров`
--

CREATE TABLE `журнал_номеров` (
  `Код_жн` int UNSIGNED NOT NULL,
  `Код_номера` int UNSIGNED NOT NULL,
  `Код_бронирования` int UNSIGNED NOT NULL,
  `Код_администратора` int UNSIGNED NOT NULL,
  `Дата` date NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

--
-- Дамп данных таблицы `журнал_номеров`
--

INSERT INTO `журнал_номеров` (`Код_жн`, `Код_номера`, `Код_бронирования`, `Код_администратора`, `Дата`) VALUES
(1, 2, 1, 1, '2026-07-01'),
(2, 5, 2, 1, '2026-06-10'),
(3, 3, 3, 2, '2026-08-20'),
(4, 8, 4, 2, '2026-08-25'),
(5, 1, 5, 3, '2026-07-15'),
(6, 9, 6, 3, '2026-09-01'),
(7, 4, 7, 2, '2026-05-10'),
(8, 6, 8, 1, '2026-09-10'),
(9, 3, 11, 1, '2026-08-24'),
(10, 4, 12, 1, '2026-08-24'),
(12, 1, 14, 1, '2026-08-24'),
(13, 9, 15, 1, '2026-08-25'),
(14, 10, 16, 1, '2026-08-25'),
(18, 7, 19, 1, '2026-08-26'),
(19, 1, 20, 1, '2026-08-26'),
(20, 11, 21, 1, '2026-08-26'),
(22, 7, 23, 1, '2026-08-27'),
(23, 9, 24, 1, '2026-08-27'),
(25, 3, 26, 1, '2026-08-30'),
(26, 1, 27, 1, '2026-08-30'),
(27, 7, 28, 1, '2026-08-31'),
(28, 6, 29, 1, '2026-08-31'),
(29, 11, 30, 1, '2026-09-07'),
(30, 3, 31, 1, '2026-09-07');

-- --------------------------------------------------------

--
-- Структура таблицы `заказ_услуги`
--

CREATE TABLE `заказ_услуги` (
  `Код_заказа_услуги` int UNSIGNED NOT NULL,
  `Код_бронирования` int UNSIGNED NOT NULL,
  `Код_услуги` int UNSIGNED NOT NULL,
  `Количество` int UNSIGNED NOT NULL,
  `Стоимость_при_заказе` decimal(10,2) NOT NULL DEFAULT '0.00',
  `Дата_услуги` date NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

--
-- Дамп данных таблицы `заказ_услуги`
--

INSERT INTO `заказ_услуги` (`Код_заказа_услуги`, `Код_бронирования`, `Код_услуги`, `Количество`, `Стоимость_при_заказе`, `Дата_услуги`) VALUES
(1, 1, 1, 2, '800.00', '2026-07-02'),
(2, 1, 6, 2, '600.00', '2026-07-03'),
(3, 2, 2, 1, '2500.00', '2026-06-12'),
(4, 3, 4, 2, '1500.00', '2026-08-21'),
(5, 4, 5, 1, '2000.00', '2026-08-26'),
(6, 6, 3, 1, '700.00', '2026-09-02'),
(7, 6, 5, 2, '2000.00', '2026-09-03'),
(8, 8, 1, 3, '800.00', '2026-09-11'),
(12, 11, 6, 1, '600.00', '2026-08-26'),
(13, 14, 6, 1, '600.00', '2026-08-29'),
(14, 15, 1, 1, '800.00', '2026-08-25'),
(15, 16, 6, 1, '600.00', '2026-08-25'),
(16, 19, 3, 1, '700.00', '2026-08-26'),
(17, 20, 2, 1, '2500.00', '2026-08-27'),
(18, 20, 7, 1, '200.00', '2026-08-27'),
(19, 23, 6, 1, '600.00', '2026-08-27'),
(20, 24, 1, 1, '800.00', '2026-08-27'),
(22, 26, 1, 2, '800.00', '2026-08-30'),
(23, 27, 2, 1, '2500.00', '2026-08-30'),
(24, 28, 6, 1, '600.00', '2026-08-31'),
(25, 30, 3, 1, '773.00', '2026-09-08');

-- --------------------------------------------------------

--
-- Структура таблицы `зарег_пользователь`
--

CREATE TABLE `зарег_пользователь` (
  `Код_пользователя` int UNSIGNED NOT NULL,
  `Фамилия` varchar(20) COLLATE utf8mb4_unicode_ci NOT NULL,
  `Имя` varchar(20) COLLATE utf8mb4_unicode_ci NOT NULL,
  `Отчество` varchar(20) COLLATE utf8mb4_unicode_ci NOT NULL,
  `Телефон` varchar(20) COLLATE utf8mb4_unicode_ci NOT NULL,
  `Email` varchar(50) COLLATE utf8mb4_unicode_ci NOT NULL,
  `Логин` varchar(20) COLLATE utf8mb4_unicode_ci NOT NULL,
  `Пароль` varchar(100) COLLATE utf8mb4_unicode_ci NOT NULL,
  `Дата_регистрации` datetime DEFAULT CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `зарег_пользователь`
--

INSERT INTO `зарег_пользователь` (`Код_пользователя`, `Фамилия`, `Имя`, `Отчество`, `Телефон`, `Email`, `Логин`, `Пароль`, `Дата_регистрации`) VALUES
(1, 'Иванов', 'Иван', 'Иванович', '+79991234567', 'ivan@mail.ru', 'ivan123', 'Qwerty1', '2026-08-23 21:44:31'),
(2, 'Смирнова', 'Елена', 'Андреевна', '+79992345678', 'elena@mail.ru', 'elena22', 'Pass123', '2026-08-23 21:44:31'),
(3, 'Кузнецов', 'Алексей', 'Сергеевич', '+79993456789', 'alex@mail.ru', 'alex88', 'Alex123', '2026-08-23 21:44:31'),
(4, 'Соколова', 'Мария', 'Дмитриевна', '+79994567890', 'maria@mail.ru', 'maria7', 'Maria123', '2026-08-23 21:44:31'),
(5, 'Попов', 'Дмитрий', 'Олегович', '+79995678901', 'dmitry@mail.ru', 'dima90', 'Dima123', '2026-08-23 21:44:31'),
(6, 'Волкова', 'Анна', 'Игоревна', '+79996789012', 'anna@mail.ru', 'anna25', 'Anna123', '2026-08-23 21:44:31'),
(7, 'Иванов', 'Иван', 'Иванович', '89999999999', 'kjsnfkjn@gmail.com', 'qwerty', '$2y$10$dLterLxstkY9igAGX0le1emcrC9H1uRZohjfLUd5yJ7P4H9JI8PTW', '2026-08-23 22:39:06'),
(8, 'Сичинская', 'Марина', 'Павловна', '89059567567', 'qwerty@gmail.com', 'asdfgh', '$2y$10$p.pTJfm8tqS7BnRtlzG0a.S1kH21ILwT2kHabU8C7wFKJmyRNlYeu', '2026-08-27 15:12:32');

-- --------------------------------------------------------

--
-- Структура таблицы `оплата`
--

CREATE TABLE `оплата` (
  `Код_оплаты` int UNSIGNED NOT NULL,
  `Код_бронирования` int UNSIGNED NOT NULL,
  `Сумма` int UNSIGNED NOT NULL,
  `Дата_оплаты` date NOT NULL,
  `Способ_оплаты` varchar(30) NOT NULL,
  `Статус_оплаты` varchar(30) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

--
-- Дамп данных таблицы `оплата`
--

INSERT INTO `оплата` (`Код_оплаты`, `Код_бронирования`, `Сумма`, `Дата_оплаты`, `Способ_оплаты`, `Статус_оплаты`) VALUES
(1, 1, 14000, '2026-06-20', 'Банковская карта', 'Оплачено'),
(2, 2, 35000, '2026-06-05', 'Банковская карта', 'Оплачено'),
(3, 3, 10000, '2026-08-15', 'СБП', 'Предоплата'),
(4, 4, 30000, '2026-08-18', 'Банковская карта', 'Оплачено'),
(5, 6, 45000, '2026-08-20', 'СБП', 'Предоплата'),
(6, 7, 10000, '2026-05-05', 'Наличные', 'Оплачено'),
(7, 8, 28000, '2026-09-01', 'Банковская карта', 'Оплачено'),
(9, 23, 30600, '2026-08-27', 'Не выбран', 'Ожидает оплаты'),
(10, 24, 30800, '2026-08-27', 'Не выбран', 'Ожидает оплаты'),
(12, 26, 31600, '2026-08-30', 'Не выбран', 'Ожидает оплаты'),
(13, 27, 27000, '2026-08-30', 'Не выбран', 'Ожидает оплаты'),
(14, 28, 40600, '2026-08-31', 'Не выбран', 'Ожидает оплаты'),
(15, 29, 182000, '2026-08-31', 'Не выбран', 'Ожидает оплаты'),
(16, 30, 255773, '2026-09-07', 'Не выбран', 'Ожидает оплаты'),
(17, 31, 115000, '2026-09-07', 'Не выбран', 'Ожидает оплаты');

-- --------------------------------------------------------

--
-- Структура таблицы `номер`
--

CREATE TABLE `номер` (
  `Код_номера` int UNSIGNED NOT NULL,
  `Код_типа_номера` int UNSIGNED NOT NULL,
  `Номер_комнаты` varchar(20) NOT NULL,
  `Вместимость` int UNSIGNED NOT NULL,
  `Статус` varchar(20) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

--
-- Дамп данных таблицы `номер`
--

INSERT INTO `номер` (`Код_номера`, `Код_типа_номера`, `Номер_комнаты`, `Вместимость`, `Статус`) VALUES
(1, 1, '101', 2, 'На ремонте'),
(2, 1, '102', 2, 'Свободен'),
(3, 2, '201', 2, 'Занят'),
(4, 2, '202', 2, 'На ремонте'),
(5, 3, '205', 4, 'Занят'),
(6, 3, '206', 4, 'Занят'),
(7, 4, '301', 2, 'Свободен'),
(8, 4, '302', 2, 'Свободен'),
(9, 5, 'К1', 6, 'Свободен'),
(10, 5, 'К2', 6, 'Свободен'),
(11, 5, 'К3', 8, 'Занят');

-- --------------------------------------------------------

--
-- Структура таблицы `новости`
--

CREATE TABLE `новости` (
  `Код_новости` int UNSIGNED NOT NULL,
  `Заголовок` varchar(150) NOT NULL,
  `Текст` text NOT NULL,
  `Дата_публикации` datetime DEFAULT CURRENT_TIMESTAMP,
  `Просмотры` int UNSIGNED DEFAULT '0'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

--
-- Дамп данных таблицы `новости`
--

INSERT INTO `новости` (`Код_новости`, `Заголовок`, `Текст`, `Дата_публикации`, `Просмотры`) VALUES
(1, 'Открытие летнего сезона', 'На базе отдыха открыт летний сезон. Для гостей доступны комфортные номера, коттеджи, прокат велосипедов и лодок, а также дополнительные услуги.', '2026-08-24 13:22:18', 9),
(2, 'Новые маршруты для прогулок', 'Для гостей базы отдыха подготовлены новые прогулочные маршруты по территории и окрестностям. Маршруты подходят как для спокойных прогулок, так и для активного отдыха.', '2026-08-24 13:22:18', 0),
(3, 'Обновление дополнительных услуг', 'Теперь гости могут воспользоваться расширенным перечнем дополнительных услуг: арендой велосипеда, мангальной зоной, завтраками, прокатом лодок и другими возможностями для отдыха.', '2026-08-24 13:22:18', 1);

-- --------------------------------------------------------

--
-- Структура таблицы `статус_бронирования`
--

CREATE TABLE `статус_бронирования` (
  `Код_статуса` int UNSIGNED NOT NULL,
  `Название_статуса` varchar(30) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

--
-- Дамп данных таблицы `статус_бронирования`
--

INSERT INTO `статус_бронирования` (`Код_статуса`, `Название_статуса`) VALUES
(2, 'Подтверждено'),
(3, 'Завершено'),
(4, 'Отменено'),
(5, 'Оформлено');

-- --------------------------------------------------------

--
-- Структура таблицы `тип_номера`
--

CREATE TABLE `тип_номера` (
  `Код_типа_номера` int UNSIGNED NOT NULL,
  `Название` varchar(30) NOT NULL,
  `Стоимость_сутки` int UNSIGNED NOT NULL,
  `Описание` varchar(100) NOT NULL,
  `Вместимость` int UNSIGNED NOT NULL,
  `Фото` varchar(255) DEFAULT NULL,
  `Фото_2` varchar(255) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

--
-- Дамп данных таблицы `тип_номера`
--

INSERT INTO `тип_номера` (`Код_типа_номера`, `Название`, `Стоимость_сутки`, `Описание`, `Вместимость`, `Фото`, `Фото_2`) VALUES
(1, 'Стандарт', 3500, 'Стандартный двухместный номер', 2, 'standard.jpg', 'standard_2.jpg'),
(2, 'Комфорт', 5000, 'Улучшенный двухместный номер', 2, 'comfort.jpg', 'comfort_2.jpg'),
(3, 'Семейный', 7000, 'Просторный номер для семьи', 4, 'family.jpg', 'family_2.jpg'),
(4, 'Люкс', 10000, 'Номер повышенной комфортности', 2, 'lux.jpg', 'lux_2.jpg'),
(5, 'Коттедж', 15000, 'Отдельный коттедж для компании', 6, 'cottage.jpg', 'cottage_2.jpg');

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `доп_услуга`
--
ALTER TABLE `доп_услуга`
  ADD PRIMARY KEY (`Код_услуги`);

--
-- Индексы таблицы `администратор`
--
ALTER TABLE `администратор`
  ADD PRIMARY KEY (`Код_администратора`),
  ADD UNIQUE KEY `Логин` (`Логин`);

--
-- Индексы таблицы `бронирование`
--
ALTER TABLE `бронирование`
  ADD PRIMARY KEY (`Код_бронирования`),
  ADD KEY `Код_пользователя` (`Код_пользователя`),
  ADD KEY `Код_администратора` (`Код_администратора`),
  ADD KEY `Код_статуса` (`Код_статуса`),
  ADD KEY `Код_типа_номера` (`Код_типа_номера`);

--
-- Индексы таблицы `временная_таблица`
--
ALTER TABLE `временная_таблица`
  ADD PRIMARY KEY (`Код_записи`);

--
-- Индексы таблицы `журнал_номеров`
--
ALTER TABLE `журнал_номеров`
  ADD PRIMARY KEY (`Код_жн`),
  ADD KEY `Код_номера` (`Код_номера`),
  ADD KEY `Код_бронирования` (`Код_бронирования`),
  ADD KEY `Код_администратора` (`Код_администратора`);

--
-- Индексы таблицы `заказ_услуги`
--
ALTER TABLE `заказ_услуги`
  ADD PRIMARY KEY (`Код_заказа_услуги`),
  ADD KEY `Код_бронирования` (`Код_бронирования`),
  ADD KEY `fk_заказ_услуга` (`Код_услуги`);

--
-- Индексы таблицы `зарег_пользователь`
--
ALTER TABLE `зарег_пользователь`
  ADD PRIMARY KEY (`Код_пользователя`),
  ADD UNIQUE KEY `Логин` (`Логин`);

--
-- Индексы таблицы `оплата`
--
ALTER TABLE `оплата`
  ADD PRIMARY KEY (`Код_оплаты`),
  ADD KEY `Код_бронирования` (`Код_бронирования`);

--
-- Индексы таблицы `номер`
--
ALTER TABLE `номер`
  ADD PRIMARY KEY (`Код_номера`),
  ADD KEY `Код_типа_номера` (`Код_типа_номера`);

--
-- Индексы таблицы `новости`
--
ALTER TABLE `новости`
  ADD PRIMARY KEY (`Код_новости`);

--
-- Индексы таблицы `статус_бронирования`
--
ALTER TABLE `статус_бронирования`
  ADD PRIMARY KEY (`Код_статуса`);

--
-- Индексы таблицы `тип_номера`
--
ALTER TABLE `тип_номера`
  ADD PRIMARY KEY (`Код_типа_номера`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `доп_услуга`
--
ALTER TABLE `доп_услуга`
  MODIFY `Код_услуги` int UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=8;

--
-- AUTO_INCREMENT для таблицы `администратор`
--
ALTER TABLE `администратор`
  MODIFY `Код_администратора` int UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;

--
-- AUTO_INCREMENT для таблицы `бронирование`
--
ALTER TABLE `бронирование`
  MODIFY `Код_бронирования` int UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=32;

--
-- AUTO_INCREMENT для таблицы `временная_таблица`
--
ALTER TABLE `временная_таблица`
  MODIFY `Код_записи` int UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT для таблицы `журнал_номеров`
--
ALTER TABLE `журнал_номеров`
  MODIFY `Код_жн` int UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=31;

--
-- AUTO_INCREMENT для таблицы `заказ_услуги`
--
ALTER TABLE `заказ_услуги`
  MODIFY `Код_заказа_услуги` int UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=26;

--
-- AUTO_INCREMENT для таблицы `зарег_пользователь`
--
ALTER TABLE `зарег_пользователь`
  MODIFY `Код_пользователя` int UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=9;

--
-- AUTO_INCREMENT для таблицы `оплата`
--
ALTER TABLE `оплата`
  MODIFY `Код_оплаты` int UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=18;

--
-- AUTO_INCREMENT для таблицы `номер`
--
ALTER TABLE `номер`
  MODIFY `Код_номера` int UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=12;

--
-- AUTO_INCREMENT для таблицы `новости`
--
ALTER TABLE `новости`
  MODIFY `Код_новости` int UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;

--
-- AUTO_INCREMENT для таблицы `статус_бронирования`
--
ALTER TABLE `статус_бронирования`
  MODIFY `Код_статуса` int UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=6;

--
-- AUTO_INCREMENT для таблицы `тип_номера`
--
ALTER TABLE `тип_номера`
  MODIFY `Код_типа_номера` int UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=6;

--
-- Ограничения внешнего ключа сохраненных таблиц
--

--
-- Ограничения внешнего ключа таблицы `бронирование`
--
ALTER TABLE `бронирование`
  ADD CONSTRAINT `бронирование_ibfk_1` FOREIGN KEY (`Код_пользователя`) REFERENCES `зарег_пользователь` (`Код_пользователя`),
  ADD CONSTRAINT `бронирование_ibfk_2` FOREIGN KEY (`Код_администратора`) REFERENCES `администратор` (`Код_администратора`),
  ADD CONSTRAINT `бронирование_ibfk_3` FOREIGN KEY (`Код_статуса`) REFERENCES `статус_бронирования` (`Код_статуса`),
  ADD CONSTRAINT `бронирование_ibfk_4` FOREIGN KEY (`Код_типа_номера`) REFERENCES `тип_номера` (`Код_типа_номера`);

--
-- Ограничения внешнего ключа таблицы `журнал_номеров`
--
ALTER TABLE `журнал_номеров`
  ADD CONSTRAINT `журнал_номеров_ibfk_1` FOREIGN KEY (`Код_номера`) REFERENCES `номер` (`Код_номера`),
  ADD CONSTRAINT `журнал_номеров_ibfk_2` FOREIGN KEY (`Код_бронирования`) REFERENCES `бронирование` (`Код_бронирования`),
  ADD CONSTRAINT `журнал_номеров_ibfk_3` FOREIGN KEY (`Код_администратора`) REFERENCES `администратор` (`Код_администратора`);

--
-- Ограничения внешнего ключа таблицы `заказ_услуги`
--
ALTER TABLE `заказ_услуги`
  ADD CONSTRAINT `fk_заказ_услуга` FOREIGN KEY (`Код_услуги`) REFERENCES `доп_услуга` (`Код_услуги`),
  ADD CONSTRAINT `заказ_услуги_ibfk_1` FOREIGN KEY (`Код_бронирования`) REFERENCES `бронирование` (`Код_бронирования`);

--
-- Ограничения внешнего ключа таблицы `оплата`
--
ALTER TABLE `оплата`
  ADD CONSTRAINT `оплата_ibfk_1` FOREIGN KEY (`Код_бронирования`) REFERENCES `бронирование` (`Код_бронирования`);

--
-- Ограничения внешнего ключа таблицы `номер`
--
ALTER TABLE `номер`
  ADD CONSTRAINT `номер_ibfk_1` FOREIGN KEY (`Код_типа_номера`) REFERENCES `тип_номера` (`Код_типа_номера`);
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
